javyog/STM32Tris/code/Src/game.c
/*
 * game.c
 *
 *  Created on: Apr 24, 2016
 *      Author: Javier Oliver
 */

    /*
     * ToDO:  * When moving right or moving down, it would be interesting to do some spaceDown, spaceLeft,
     * 			spaceRight and only then move the block
     * 		  * Add sound
     * 		  * Change block creation method. Atm I create another blank screen array which has the block and I have to iterate
     * 		 	every time the user press a button. I add the block array to a pile array and then display.
     * 		 	I could have a type block with coordinate to speed up the thing
     * 		  * Add a true random generator. The sequence is always the same as it is now by using rand()
     * */

	/* Includes */
	#include <game.h>
	#include <mxconstants.h>
	#include <stm32f1xx_hal_gpio.h>
	#include <sys/_stdint.h>



	/*##### Variables #####*/
	/* Number of lines killed. If top ten score, we will save it*/
	uint32_t numLines;

	/* Counter to check if we are idle and we should go to sleep
	 * It will be refreshed inside the game engine if we press a button*/
	uint8_t sleepCountDown = COUNT_DOWN;


	/* After thinking how to represent the block,
	 * i thought to have a matrix with 4 dots in it and the OR function to display */
	TScreenMatrix blockMatrix = {{0}};
	/* This variable will the blocks that are not moving */
	TScreenMatrix pileMatrix = {{0}};
	/* This variable will hold the current screen status to show in the led matrix*/
	TScreenMatrix displayMatrix = {{0}};

	/* Current game state */
	currentStatus gameState = IDLE;
	/* The type of block being played*/
	typeBlock currentBlock = NONE;
	/* Current rotation state */
	uint8_t rotation = 0;

	/*##### Variables ENDS #####*/

	/* constants */
	TScreenMatrix gameIdle = {
							/*     (0,0) X ——►
							 *      Y
							 *      |
							 *      ▼
							 *      ..
							 *      ..
							 *      ..
							 *    				(15,7)
							 * */
									{1,1,1,0,1,1,1,0},
									{0,1,0,0,1,0,0,0},
									{0,1,0,0,1,1,1,0},
									{0,1,0,0,1,0,0,0},
									{0,1,0,0,1,1,1,0},
									{0,0,0,0,0,0,0,0},
									{1,1,1,0,1,1,0,0},
									{0,1,0,0,1,0,1,0},
									{0,1,0,0,1,1,0,0},
									{0,1,0,0,1,0,1,0},
									{0,0,0,0,0,0,0,0},
									{1,1,1,0,0,1,1,0},
									{0,1,0,0,1,0,0,0},
									{0,1,0,0,0,1,0,0},
									{0,1,0,0,0,0,1,0},
									{1,1,1,0,1,1,0,0}
								   };

	TScreenMatrix gameBlank = {
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0}
								   };

	TScreenMatrix gameOver = {
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,1,0,1,1,0,1,0},
									{0,0,1,0,0,1,0,0},
									{0,1,0,1,1,0,1,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,1,1,1,1,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0},
									{0,0,0,0,0,0,0,0}
								   };



	 /* With every button interrupt we have to refresh the counter*/
	void GAME_goToSleepTask_1000ms(void){

	}

	/* This function will rotate the current block */
	void GAME_rotateBlock(){
		uint8_t row;
		uint8_t column;
		uint8_t found = 0;

		/* o o
		 * o o
		 * */
		if (currentBlock == O) return;

		/*     .
		 * o o o o
		 * */
		if (currentBlock == I){
			for (row = (ROW - 1); ((row >= 0)&& (found == 0)); row--){
				for (column = 0; (column <= (COLUMN - 1) && (found == 0)); column++){
					/* This will be the most left down dot*/
					if (blockMatrix[row][column] == 1){
						found = 1;
						/* o o o o */
						if (rotation == 0){
							/* limits with the screen*/
							if ((row == 0)|| (row >= 14)){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row - 1][column + 2]) == 1) ||
									((pileMatrix[row + 1][column + 2]) == 1) ||
									((pileMatrix[row + 2][column + 2]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row - 1][column + 2] = 1;
									blockMatrix[row + 1][column + 2] = 1;
									blockMatrix[row + 2][column + 2] = 1;
									blockMatrix[row][column] = 0;
									blockMatrix[row][column + 1] = 0;
									blockMatrix[row][column + 3] = 0;
									rotation = 1;

								}
							}
						}
						else{
							 /* o
							  .	o
								o
								o
							 */

							/* limits with the screen*/
							if ((column == (COLUMN - 1))|| (column < 2)){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row - 2][column - 2]) == 1) ||
									((pileMatrix[row - 2][column - 1]) == 1) ||
									((pileMatrix[row - 2][column + 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row - 2][column - 2] = 1;
									blockMatrix[row - 2][column - 1] = 1;
									blockMatrix[row - 2][column + 1] = 1;
									blockMatrix[row][column] = 0;
									blockMatrix[row - 1][column] = 0;
									blockMatrix[row - 3][column] = 0;
									rotation = 1;
								}
							}

							rotation = 0;
						}
					}
				}
			}
		}


		if (currentBlock == S){
			for (row = (ROW - 1); ((row >= 0)&& (found == 0)); row--){
				for (column = 0; (column <= (COLUMN - 1) && (found == 0)); column++){
					/* This will be the most left down dot*/
					if (blockMatrix[row][column] == 1){
						found = 1;
						/*   .
						 *   o o
						 * o o
						 * */
						if (rotation == 0){
							/* limits with the screen*/
							if (row <= 1){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row][column + 2]) == 1) ||
									((pileMatrix[row - 2][column + 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row][column + 2] = 1;
									blockMatrix[row - 2][column + 1] = 1;
									blockMatrix[row][column] = 0;
									blockMatrix[row][column + 1] = 0;
									rotation = 1;

