javyog/STM32Tris/code/Src/game.c
								}
							}
						}
						else{
							/*   o
							 * . o o
							 *     o
							 * */

							/* limits with the screen*/
							if (column <= 1){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row][column - 2]) == 1) ||
									((pileMatrix[row][column - 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row][column - 2] = 1;
									blockMatrix[row][column - 1] = 1;
									blockMatrix[row - 2][column - 1] = 0;
									blockMatrix[row][column] = 0;
									rotation = 1;

								}
							}

							rotation = 0;
						}
					}
				}

			}
		}

		if (currentBlock == Z){
			for (row = (ROW - 1); ((row >= 0)&& (found == 0)); row--){
				for (column = 0; (column <= (COLUMN - 1) && (found == 0)); column++){
					/* This will be the most left down dot*/
					if (blockMatrix[row][column] == 1){
						found = 1;
						/*   .
						 * o o
						 *   o o
						 * */
						if (rotation == 0){
							/* limits with the screen*/
							if (row <= 1){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row][column - 1]) == 1) ||
									((pileMatrix[row - 2][column]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row][column - 1] = 1;
									blockMatrix[row - 2][column] = 1;
									blockMatrix[row][column] = 0;
									blockMatrix[row][column + 1] = 0;
									rotation = 1;

								}
							}
						}
						else{
							/*     o
							 * . o o
							 *   o
							 * */

							/* limits with the screen*/
							if (column >= 6){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row][column + 1]) == 1) ||
									((pileMatrix[row][column + 2]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row][column + 1] = 1;
									blockMatrix[row][column + 2] = 1;
									blockMatrix[row][column] = 0;
									blockMatrix[row - 2][column + 1] = 0;
									rotation = 1;

								}
							}

							rotation = 0;
						}
					}
				}

			}
		}

		if (currentBlock == T){
			for (row = (ROW - 1); ((row >= 0)&& (found == 0)); row--){
				for (column = 0; (column <= (COLUMN - 1) && (found == 0)); column++){
					/* This will be the most left down dot*/
					if (blockMatrix[row][column] == 1){
						found = 1;
						/*   .
						 * o o o
						 *   o
						 * */
						if (rotation == 0){
							/* limits with the screen*/
							if (row <= 1){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row - 2][column]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row - 2][column] = 1;
									blockMatrix[row - 1][column - 1] = 0;
									rotation = 1;

								}
							}
						}
						else if(rotation == 1){
							/*   o
							 * . o o
							 *   o
							 * */

							/* limits with the screen*/
							if (column == 0){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row - 1][column - 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row - 1][column - 1] = 1;
									blockMatrix[row][column] = 0;
									rotation = 2;
								}
							}
						}
						else if(rotation == 2){
							/*   o
							 * o o o
							 *   .
							 * */

							/* limits with the screen*/
							if (row >= 15){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row + 1][column + 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row + 1][column + 1] = 1;
									blockMatrix[row][column + 2] = 0;
									rotation = 3;
								}
							}
						}
						else if(rotation == 3){
							/*   o
							 * o o .
							 *   o
							 * */

							/* limits with the screen*/
							if (column >= 7){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row - 1][column + 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row - 1][column + 1] = 1;
									blockMatrix[row - 2][column] = 0;
									rotation = 0;
								}
							}
						}
					}
				}

			}
		}


		if (currentBlock == L){
			for (row = (ROW - 1); ((row >= 0)&& (found == 0)); row--){
				for (column = 0; (column <= (COLUMN - 1) && (found == 0)); column++){
					/* This will be the most left down dot*/
					if (blockMatrix[row][column] == 1){
						found = 1;
						/*   .
						 * o o o
						 * o
						 * */
						if (rotation == 0){
							/* limits with the screen*/
							if (row <= 1){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row][column + 1]) == 1) ||
									((pileMatrix[row][column + 2]) == 1) ||
									((pileMatrix[row - 2][column + 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row][column + 1] = 1;
									blockMatrix[row][column + 2] = 1;
									blockMatrix[row - 2][column + 1] = 1;

									blockMatrix[row][column] = 0;
									blockMatrix[row - 1][column] = 0;
									blockMatrix[row - 1][column + 2] = 0;
									rotation = 1;
								}
							}
						}
						else if(rotation == 1){
							/*   o
							 * . o
							 *   o o
							 * */

							/* limits with the screen*/
							if (column == 0){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row - 1][column + 1]) == 1) ||
									((pileMatrix[row - 2][column + 1]) == 1) ||
									((pileMatrix[row - 1][column - 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row - 1][column + 1] = 1;
									blockMatrix[row - 2][column + 1] = 1;
									blockMatrix[row - 1][column - 1] = 1;

									blockMatrix[row][column] = 0;
									blockMatrix[row][column + 1] = 0;
									blockMatrix[row - 2][column] = 0;
									rotation = 2;
								}
							}
						}
						else if(rotation == 2){
							/*     o
							 * o o o
							 *   .
							 * */

							/* limits with the screen*/
							if (row >= 15){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row - 1][column]) == 1) ||
									((pileMatrix[row - 1][column + 1]) == 1) ||
									((pileMatrix[row + 1][column + 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row - 1][column] = 1;
									blockMatrix[row - 1][column + 1] = 1;
									blockMatrix[row + 1][column + 1] = 1;

									blockMatrix[row][column] = 0;
									blockMatrix[row][column + 2] = 0;
									blockMatrix[row - 1][column + 2] = 0;
									rotation = 3;
								}
							}
						}
						else if(rotation == 3){
							/* o o
							 *   o .
							 *   o
							 * */

							/* limits with the screen*/
							if (column >= 7){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row][column - 1]) == 1) ||
									((pileMatrix[row - 1][column - 1]) == 1) ||
									((pileMatrix[row - 1][column + 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row][column - 1] = 1;
									blockMatrix[row - 1][column - 1] = 1;
									blockMatrix[row - 1][column + 1]= 1;

									blockMatrix[row][column] = 0;
									blockMatrix[row - 2][column] = 0;
									blockMatrix[row - 2][column - 1] = 0;
									rotation = 0;
								}
							}
						}
					}
				}

