javyog/STM32Tris/code/Src/game.c
			}
		}

		if (currentBlock == J){
			for (row = (ROW - 1); ((row >= 0)&& (found == 0)); row--){
				for (column = 0; (column <= (COLUMN - 1) && (found == 0)); column++){
					/* This will be the most left down dot*/
					if (blockMatrix[row][column] == 1){
						found = 1;
						/*   .
						 * o o o
						 *     o
						 * */
						if (rotation == 0){
							/* limits with the screen*/
							if (row <= 1){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row][column - 1]) == 1) ||
									((pileMatrix[row - 2][column]) == 1) ||
									((pileMatrix[row - 2][column - 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row][column - 1] = 1;
									blockMatrix[row - 2][column] = 1;
									blockMatrix[row - 2][column - 1] = 1;

									blockMatrix[row][column] = 0;
									blockMatrix[row - 1][column] = 0;
									blockMatrix[row - 1][column - 2] = 0;
									rotation = 1;
								}
							}
						}
						else if(rotation == 1){
							/*   o o
							 * . o
							 *   o
							 * */

							/* limits with the screen*/
							if (column == 0){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row - 1][column + 1]) == 1) ||
									((pileMatrix[row - 2][column - 1]) == 1) ||
									((pileMatrix[row - 1][column - 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row - 1][column + 1] = 1;
									blockMatrix[row - 2][column - 1] = 1;
									blockMatrix[row - 1][column - 1] = 1;

									blockMatrix[row][column] = 0;
									blockMatrix[row - 2][column] = 0;
									blockMatrix[row - 2][column + 1] = 0;
									rotation = 2;
								}
							}
						}
						else if(rotation == 2){
							/* o
							 * o o o
							 *   .
							 * */

							/* limits with the screen*/
							if (row >= 15){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row + 1][column + 1]) == 1) ||
									((pileMatrix[row + 1][column]) == 1) ||
									((pileMatrix[row - 1][column + 1]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row + 1][column + 1] = 1;
									blockMatrix[row + 1][column] = 1;
									blockMatrix[row - 1][column + 1] = 1;

									blockMatrix[row][column] = 0;
									blockMatrix[row - 1][column] = 0;
									blockMatrix[row][column + 2] = 0;
									rotation = 3;
								}
							}
						}
						else if(rotation == 3){
							/*   o
							 *   o .
							 * o o
							 * */

							/* limits with the screen*/
							if (column >= 7){
								return;
							}else{
								/* space with the pile for rotation */
								if (((pileMatrix[row][column + 2]) == 1) ||
									((pileMatrix[row - 1][column + 2]) == 1) ||
									((pileMatrix[row - 1][column]) == 1)){
										/* no space, return*/
										return;
								}else{
									blockMatrix[row][column + 2] = 1;
									blockMatrix[row - 1][column + 2] = 1;
									blockMatrix[row - 1][column]= 1;

									blockMatrix[row][column] = 0;
									blockMatrix[row][column + 1] = 0;
									blockMatrix[row - 2][column + 1] = 0;
									rotation = 0;
								}
							}
						}
					}
				}
			}
		}
		/* Updating screen */
		for(row = 0; row < ROW; row++){
			/* Updating the current block */
			for (column = 0; column < COLUMN; column++) {
				displayMatrix[row][column] = (pileMatrix[row][column] | blockMatrix[row][column]);
			}
		}

	}

	/* Function to move a block left -- eg. (*displayMatrix)[1][0] = 7;*/
	void GAME_moveLeft(){

		/* Variable to hold the updated block. It will be used to detect collisions*/
		TScreenMatrix movedBlock = {{0}};
		int row;
		int column;
		uint8_t stop = 0;


		/* From right to left */
		for (row = (ROW - 1); (row >= 0) && (stop == 0); row--){
			for (column = 0; column <= (COLUMN - 1); column++){
				if (blockMatrix[row][column] == 1){
					/* If we are in the most right */
					if(column == 0) stop = 1;
					/* Below we have an obstacle*/
					if(column > 0){
						if(pileMatrix[row][column - 1] == 1)stop = 1;
					}
					movedBlock[row][column] = 0;
					movedBlock[row][column - 1] = 1;
				}
			}
		}

		/* After checking the block against the display matrix we take actions*/
		if (stop == 0){

			for(row = 0; row < ROW; row++){
				/* Updating the current block */
				for (column = 0; column < COLUMN; column++) {
					blockMatrix[row][column] = movedBlock[row][column];
					displayMatrix[row][column] = (pileMatrix[row][column] | blockMatrix[row][column]);
				}
			}

		}else
		{
			/* If we reach this means that we have an obstacle and thus we should not move the block */
		}

	}


	/* Function to move a block right */
	void GAME_moveRight(){
		/* Variable to hold the updated block. It will be used to detect collisions*/
		TScreenMatrix movedBlock = {{0}};
		int row;
		int column;
		uint8_t stop = 0;


		/* From right to left */
		for (row = (ROW - 1); (row >= 0) && (stop == 0); row--){
			for (column = (COLUMN - 1); column >= 0; column--){
				if (blockMatrix[row][column] == 1){
					/* If we are in the most right */
					if(column == (COLUMN - 1)) stop = 1;
					/* Below we have an obstacle*/
					if(column < (COLUMN - 1)){
						if(pileMatrix[row][column + 1] == 1)stop = 1;
					}
					movedBlock[row][column] = 0;
					movedBlock[row][column + 1] = 1;
				}
			}
		}

		/* After checking the block against the display matrix we take actions*/
		if (stop == 0){

			for(row = 0; row < ROW; row++){
				/* Updating the current block */
				for (column = 0; column < COLUMN; column++) {
					blockMatrix[row][column] = movedBlock[row][column];
					displayMatrix[row][column] = (pileMatrix[row][column] | blockMatrix[row][column]);
				}
			}

		}else
		{
			/* If we reach this means that we have an obstacle and thus we should not move the block */
		}

	}




	/* Function to move a block to the bottom until down is not pressed */
	void GAME_moveToBottom(){
		GAME_moveDown();
	}

	/* Function to move the block 1 row down*/
	void GAME_moveDown(){
		/* Variable to hold the updated block. It will be used to detect collisions*/
		TScreenMatrix movedBlock = {{0}};
		int row;
		int column;
		int dots = 0;


