javyog/STM32Tris/code/Src/game.c
		/* We need to find 4 dots and they need to be not blocked in order to move down*/


		/* From bottom to top we check the pile */
		for (row = (ROW - 1); (row >= 0); row--){

			for (column = 0; column < COLUMN; column++){
				if (blockMatrix[row][column] == 1){
					/* Row 15 reached */
					if(row == (ROW - 1)) break;
					/* Below we have an obstacle*/
					if (row < (ROW-1)){
						if(pileMatrix[row + 1][column] == 1)break;
					}
					movedBlock[row][column] = 0;
					movedBlock[row + 1][column] = 1;
					dots++;
				}
			}
		}

		/* After checking the block against the display matrix we take actions*/
		if (dots == 4){

			for(row = 0; row < ROW; row++){
				/* Updating the current block */
				for (column = 0; column < COLUMN; column++) {
					blockMatrix[row][column] = movedBlock[row][column];
					displayMatrix[row][column] = (pileMatrix[row][column] | blockMatrix[row][column]);
				}
			}

		}else{
			for(row = 0; row < ROW; row++){
				/* Updating the current pile with the block which was used to call this function */
				for (column = 0; column < COLUMN; column++) {
					pileMatrix[row][column] |= blockMatrix[row][column];
					displayMatrix[row][column] = pileMatrix[row][column];
				}
			}
			/* No block to move, flag to generate a new one in the engine */
			currentBlock = NONE;
		}

	}


	/* This function will check if a complete line has been filled.
	 * If a row is completed, it will return the line else -1*/
	void GAME_checkFullRows(){
		uint8_t row;
		uint8_t column;
		uint8_t dots = 0;


		/* From bottom to top we check the pile */
		for (row = 0; row < ROW; row++){
			if (dots == 8){
				GAME_removeRow (row - 1);
				HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);
			}
			dots = 0;
			for (column = 0; column < COLUMN; column++){
				if (pileMatrix[row][column] == 1) dots ++;
			}
		}
	}

	/* this function will remove the row when completed.*/
	void GAME_removeRow(int rowFull){
		int row;
		uint8_t column;

		/* From bottom to top we check the pile */
		for (row = rowFull; row >= 0; row--){
			for (column = 0; column < COLUMN; column++){
				if (row == 0){
					pileMatrix[row][column] = 0;
					displayMatrix[row][column] = 0;
				}else {
					pileMatrix[row][column] = pileMatrix[row - 1][column];
					displayMatrix[row][column] = displayMatrix[row - 1][column];
				}
			}
		}
		numLines++;

	}

	/* Show lines killed after GAME OVER */
	void GAME_showResults(){

	}


	/* Dumps the screenToCopy variable into the screen variable */
	void GAME_copyScreen(TScreenMatrix screenToCopy){
		uint8_t i;
		uint8_t j;

		/* Copy the gameOver screen to the current matrix */
		for(i = 0; i < ROW; i++){
			for (j = 0; j < COLUMN; j++)displayMatrix[i][j] = screenToCopy[i][j];
		}

	}

	/* Save the score to the flash for having a ranking*/
	void GAME_saveScore(uint32_t lines){

	}

	/* Game configuration */
	void GAME_Config(void){
		numLines = 0;
		GAME_copyScreen(gameIdle);
	}

	/* This function will create a block if there is NONE */
	void GAME_CreateBlock(){
		uint8_t row;
		uint8_t column;
		uint8_t gameFinished = 0;


		for(row = 0; row < ROW; row++){
			/* Updating the current Screen */
			for (column = 0; column < COLUMN; column++) {
				blockMatrix[row][column] = 0;
			}
		}

		/* To DO: Implement a true random generator*/
		switch(rand() % 7){
		    /*  o o
		     *  o o
		     * */
			case 0:
					/* Checking if we can place a new block */
					if ((displayMatrix[0][3] == 1) || (displayMatrix[0][4] == 1)||
						(displayMatrix[1][3] == 1) || (displayMatrix[1][4] == 1)) gameFinished = 1;

					currentBlock = O;
					blockMatrix[0][3] = 1;
					blockMatrix[0][4] = 1;
					blockMatrix[1][3] = 1;
					blockMatrix[1][4] = 1;
					displayMatrix[0][3] = 1;
					displayMatrix[0][4] = 1;
					displayMatrix[1][3] = 1;
					displayMatrix[1][4] = 1;
				break;
			case 1:
			    /*
			     *  o o o o
			     * */
					/* Checking if we can place a new block */
					if ((displayMatrix[0][2] == 1) || (displayMatrix[0][3] == 1)||
						(displayMatrix[0][4] == 1) || (displayMatrix[0][5] == 1)) gameFinished = 1;

					currentBlock = I;
					blockMatrix[0][2] = 1;
					blockMatrix[0][3] = 1;
					blockMatrix[0][4] = 1;
					blockMatrix[0][5] = 1;
					displayMatrix[0][2] = 1;
					displayMatrix[0][3] = 1;
					displayMatrix[0][4] = 1;
					displayMatrix[0][5] = 1;
				break;
			case 2:
			    /*  o o o
			     *  o
			     * */
					/* Checking if we can place a new block */
					if ((displayMatrix[0][3] == 1) || (displayMatrix[0][4] == 1)||
						(displayMatrix[0][5] == 1) || (displayMatrix[1][3] == 1)) gameFinished = 1;

					currentBlock = L;
					blockMatrix[0][3] = 1;
					blockMatrix[0][4] = 1;
					blockMatrix[0][5] = 1;
					blockMatrix[1][3] = 1;
					displayMatrix[0][3] = 1;
					displayMatrix[0][4] = 1;
					displayMatrix[0][5] = 1;
					displayMatrix[1][3] = 1;
				break;

			case 3:
			    /*  o o o
			     *      o
			     * */
					/* Checking if we can place a new block */
					if ((displayMatrix[0][3] == 1) || (displayMatrix[0][4] == 1)||
						(displayMatrix[0][5] == 1) || (displayMatrix[1][5] == 1)) gameFinished = 1;

					currentBlock = J;
					blockMatrix[0][3] = 1;
					blockMatrix[0][4] = 1;
					blockMatrix[0][5] = 1;
					blockMatrix[1][5] = 1;
					displayMatrix[0][3] = 1;
					displayMatrix[0][4] = 1;
					displayMatrix[0][5] = 1;
					displayMatrix[1][5] = 1;
				break;
			case 4:
			    /*    o o
			     *  o o
			     * */
					/* Checking if we can place a new block */
					if ((displayMatrix[0][4] == 1) || (displayMatrix[0][5] == 1)||
						(displayMatrix[1][3] == 1) || (displayMatrix[1][4] == 1)) gameFinished = 1;

					currentBlock = S;
					blockMatrix[0][4] = 1;
					blockMatrix[0][5] = 1;
					blockMatrix[1][3] = 1;
					blockMatrix[1][4] = 1;
					displayMatrix[0][4] = 1;
					displayMatrix[0][5] = 1;
					displayMatrix[1][3] = 1;
					displayMatrix[1][4] = 1;
				break;
			case 5:
			    /*  o o
			     *    o o
			     * */
					/* Checking if we can place a new block */
					if ((displayMatrix[0][3] == 1) || (displayMatrix[0][4] == 1)||
						(displayMatrix[1][4] == 1) || (displayMatrix[1][5] == 1)) gameFinished = 1;

					currentBlock = Z;
					blockMatrix[0][3] = 1;
					blockMatrix[0][4] = 1;
					blockMatrix[1][4] = 1;
					blockMatrix[1][5] = 1;
					displayMatrix[0][3] = 1;
					displayMatrix[0][4] = 1;
					displayMatrix[1][4] = 1;
					displayMatrix[1][5] = 1;
				break;
			case 6:
			    /*  o o o
			     *    o
			     * */
					/* Checking if we can place a new block */
					if ((displayMatrix[0][4] == 1) || (displayMatrix[0][5] == 1)||
						(displayMatrix[1][3] == 1) || (displayMatrix[1][4] == 1)) gameFinished = 1;

